bit-finance/DataProcessors/бит_СводныйБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_СводныйБюджет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантВывода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборБюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bit-finance/Enums/бит_ТипыСохраненныхНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыСохраненныхНастроек</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НастройкиПанелиИндикаторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчеты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/СценарииПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СценарииПланирования</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта сценарий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Периодичность</Name>
					<Comment>Периодичность планирования</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПериодичностьПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьИнтервала</Name>
					<Comment>Продолжительность интервала планирования (количество периодов планирования)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьКонтроля</Name>
					<Comment>Периодичность контроля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПериодичностьПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКурсыСценария</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповойСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииТоварногоПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьКонтрольЗаявокПоЛимитам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьКонтрольГрафиковДоговоровПоЛимитам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Catalogs/Подразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Подразделения</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Comment>Произвольный код. Используется для вывода в отчетах и печатных формах.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦФО</Name>
					<Comment>Вид ЦФО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Comment>Руководитель ЦФО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяЮрЛицом</Name>
					<Comment>Признак того, что подразделение является юридическим лицом</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакАктуальности</Name>
					<Comment>Признак актуальности текущего ЦФО</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиницаРегл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/DataProcessors/бит_СводныйБюджет/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные	 действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЦветФонаИзмененногоЗначения  = ЦветаСтиля.бит_БыстрыеОтборыФонГруппы;
	ЦветРамкиКопируемогоЗначения = ЦветаСтиля.бит_ЦветЗаголовкаСтатуса;
	
	СоздатьДинамическиеРеквизиты();
	УстановитьОтборСозданныхДокументов();
	ИнициализароватьКомпоновщик();
	ЗаполнитьПоляАналитик();
	ВосстановитьНастройкиПоУмолчанию();
	УстановитьОтборСтатейБюджета();
	УстановитьУсловноеОформление();
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ЗакрытьФормуБезПодтверждения = Не Модифицированность;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриПодтвержденииЗакрытияФормы", ЭтотОбъект);
	
	ТекстПредупреждения = НСтр("ru = 'Закрытие обработки приведет к потере внесенных правок бюджета. Продолжить?'");
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияПроизвольнойФормы(ЭтотОбъект, Отказ, ЗавершениеРаботы,
		ТекстПредупреждения, "ЗакрытьФормуБезПодтверждения", ОписаниеОповещения);
	
КонецПроцедуры
	
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//	
&НаКлиенте
Процедура ПриПодтвержденииЗакрытияФормы(Результат, ДополнительныеПараметры) Экспорт
	
	Модифицированность = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура СценарийПриИзмененииНаСервере()
	
	Объект.Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Сценарий, "Валюта");
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
	Если ЗначенияПриФормированииОтчета = Неопределено Тогда
		СценарийПриИзмененииНаСервере();
	Иначе
		ПриИзмененииПоказателяОтчета(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ПриИзмененииПоказателяОтчета(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьСуммуПриИзменении(Элемент)
	
	ПриИзмененииПоказателяОтчета(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьКоличествоПриИзменении(Элемент)
	
	ПриИзмененииПоказателяОтчета(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантВыводаПриИзменении(Элемент)
	
	ПриИзмененииПоказателяОтчета(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборБюджетПриИзменении(Элемент)
	
	ПриИзмененииПоказателяОтчета(Элемент);
	УстановитьОтборСтатейБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКоэффициентыСтатейПриИзменении(Элемент)
	
	ПриИзмененииПоказателяОтчета(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультат

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	ВыделенныеОбласти = ВыделенныеОбласти();
	Если ВыделенныеОбласти.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ПараметрыОбласти = ВыделенныеОбласти[0];
	
	ДанныеРасшифровкиПоля = ДанныеРасшифровкиПоля(ПараметрыОбласти);
	
	Если ДанныеРасшифровкиПоля.ЭтоРесурс
		И НЕ ДанныеРасшифровкиПоля.ЭтоИтоги
		И НЕ ДанныеРасшифровкиПоля.ЭтоГруппа Тогда
		
		Если НЕ ЗначениеЗаполнено(ДанныеРасшифровкиПоля.Значение) Тогда
			ТекущееЗначение = ЗначениеТекстаЯчейки(ПараметрыОбласти);
			ДанныеРасшифровкиПоля.Значение = ТекущееЗначение;
		КонецЕсли;
		
		ПараметрыРедактированияБюджета = НовыеПараметрыРедактированияБюджета();
		ЗаполнитьЗначенияСвойств(ПараметрыРедактированияБюджета, ДанныеРасшифровкиПоля.ПоляРасшифровки);
		Если НЕ ДанныеРасшифровкиПоля.ПоляРасшифровки.Свойство("СтатьяОборотов")
			И ДанныеРасшифровкиПоля.ПоляРасшифровки.Свойство("СтатьяБюджета") Тогда
			ПараметрыРедактированияБюджета.СтатьяОборотов = СтатьяОборотовСтатиБюджета(
													ДанныеРасшифровкиПоля.ПоляРасшифровки.СтатьяБюджета);
		КонецЕсли;
		ПараметрыРедактированияБюджета.Сценарий      = Объект.Сценарий;
		ПараметрыРедактированияБюджета.Валюта        = Объект.Валюта;
		ПараметрыРедактированияБюджета.ТекущийБюджет = ДанныеРасшифровкиПоля.Значение;
		ЗаполнитьПараметрыТекущихПравокБюджета(ПараметрыРедактированияБюджета, ДанныеРасшифровкиПоля.ИдентификаторЯчейки);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("РедактированиеБюджетаЗавершение",
														ЭтотОбъект,
														ДанныеРасшифровкиПоля);
		
		ОткрытьФорму("Обработка.бит_СводныйБюджет.Форма.РедактированиеБюджета",
						ПараметрыРедактированияБюджета,,УникальныйИдентификатор,ВариантОткрытияОкна.ОтдельноеОкно,,ОповещениеОЗакрытии);
	Иначе
		Если ЗначениеЗаполнено(ДанныеРасшифровкиПоля.Значение) Тогда
			ПоказатьЗначение(,ДанныеРасшифровкиПоля.Значение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоляГруппировок

&НаКлиенте
Процедура ПоляГруппировокПриИзменении(Элемент)
	
	ОтключитьОбработчикОжидания("ПоляГруппировокОжиданиеИзменения");
	ПодключитьОбработчикОжидания("ПоляГруппировокОжиданиеИзменения",0.1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляГруппировокОжиданиеИзменения()
	
	УстановитьОграниченияОтборов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляГруппировокИмяМетаданныхНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПоляГруппировок.ТекущиеДанные;
	Если НЕ ТекущиеДанные.ЭтоСоставнойТип Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(КоллекцияВыбораСоставногоТипа(ТекущиеДанные.ТипСостовногоПоля));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	Если Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросОбновитьЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Обновление отчета приведет к потере внесенных правок бюджета. Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Иначе
		ОбновитьБюджетКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеНастройкаПериод(Команда)
	
	ВыборПериода(Объект.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	ВыполнитьСохранениеНастроек();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНастройки(Команда)
	
	ПараметрыФормы     = Новый Структура;
	ПараметрыФормы.Вставить("ТипНастройки",		   ПредопределенноеЗначение("Перечисление.бит_ТипыСохраненныхНастроек.Обработки"));
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", НастраиваемыйОбъект());
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьНастройкиЗавершение",ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки", ПараметрыФормы, ЭтотОбъект,,,,
		Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьБюджет(Команда)
	
	ЗапуститьЗамерДлительностиКлючевойОперации("ФормированиеБюджетныхОпераций");
	
	ДлительнаяОперация = ПараметрыФормированияБюджетныхОпераций();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru='Формирование документов'");  
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииФормированияДокументов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКопироватьДанные(Команда)
	
	ВыделенныеОбласти = ВыделенныеОбласти();
	Если ВыделенныеОбласти.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОбласти = ВыделенныеОбласти[0];
	Если Буфер <> Неопределено Тогда
		УстановитьВыделениеЯчейкиБуфера(Ложь);
	КонецЕсли;
	Буфер = ПараметрыОбласти;
	УстановитьВыделениеЯчейкиБуфера(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВставитьДанные(Команда)
	
	ВыделенныеОбласти = ВыделенныеОбласти();
	ВставитьДанныеИзБуфераВОбласть(ВыделенныеОбласти);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкрытьОтобразитьНастройки(Команда)
	
	ВидимостьНастроек = НЕ Элементы.ГруппаНастройкиОтчета.Видимость;
	Элементы.ГруппаНастройкиОтчета.Видимость = ВидимостьНастроек;
	Элементы.КомандаСкрытьОтобразитьНастройки.Заголовок = ?(ВидимостьНастроек,
															НСтр("ru='Скрыть настройки'"),
															НСтр("ru='Показать настройки'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеЭлементамиФормы(ЭтотОбъект)
	
	Элементы = ЭтотОбъект.Элементы;
	
	ЕстьИзмененияБюджета          = (ЭтотОбъект.Бюджет.Количество() > 0);
	ЭтотОбъект.Модифицированность = ЕстьИзмененияБюджета;
	Элементы.ЗафиксироватьБюджет.Доступность = ЕстьИзмененияБюджета;
	                               	
	Элементы.ДетализацияДокументов.Видимость = ЭтотОбъект.РазбиватьДокументыПоАналитикам;
	
	Элементы.ОтборБюджет.Видимость = ФормироватьВРазрезеБюджета(ЭтотОбъект.Объект.ВариантВывода);
	Элементы.ИспользоватьКоэффициентыСтатей.Видимость = ФормироватьВРазрезеБюджета(ЭтотОбъект.Объект.ВариантВывода);
	
	Элементы.ПоляГруппировокИмяМетаданных.Видимость = ЭтотОбъект.ИспользуютсяСоставныеАналитики;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ФормироватьВРазрезеБюджета(ТекущийВариантВывода)
	
	Возврат (ТекущийВариантВывода = 1);
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл отсутствие интерфейсной разметки в типовом модуле.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПоляГруппировокИспользование");
	// АПК:277-вкл
	СписокПолейСтатей = Новый СписокЗначений;
	СписокПолейСтатей.Добавить("СтатьяОборотов");
	СписокПолейСтатей.Добавить("СтатьяБюджета");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ПоляГруппировок.ИмяПоля", ВидСравненияКомпоновкиДанных.ВСписке, СписокПолейСтатей);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл отсутствие интерфейсной разметки в типовом модуле.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПоляГруппировокИмяМетаданных");
	// АПК:277-вкл
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ПоляГруппировок.ЭтоСоставнойТип", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДинамическиеРеквизиты()
	
	ДобавляемыеРеквизиты = Новый Массив;
	Аналитики            = бит_МеханизмДопИзмерений.Аналитики(Истина);
	Для каждого ОписаниеАналитки Из Аналитики Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ОписаниеАналитки.Имя, ОписаниеАналитки.ТипЗначения, "Бюджет",
															ОписаниеАналитки.Синоним));
	КонецЦикла;
	ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляАналитик()
	
	ЗаполнитьФиксированныеАналитики();
	ЗаполнитьДополнительныеАналитики();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФиксированныеАналитики()
	
	МетаданныеСправочника = Неопределено;
	ИмяПоля               = "";
	Если ФормироватьВРазрезеБюджета(Объект.ВариантВывода) Тогда
		МетаданныеСправочника = Метаданные.Справочники.бит_СтатьиБюджета;
		ИмяПоля               = "СтатьяБюджета";
	Иначе
		МетаданныеСправочника = Метаданные.Справочники.бит_СтатьиОборотов;
		ИмяПоля               = "СтатьяОборотов";
	КонецЕсли;
	ПредставлениеПоля = ОбщегоНазначения.ПредставлениеОбъекта(МетаданныеСправочника);
	ДетализацияДокументов.Добавить(ИмяПоля, ПредставлениеПоля);
	СтрокаПоля = ПоляГруппировок.Добавить();
	СтрокаПоля.ИмяПоля           = ИмяПоля;
	СтрокаПоля.ИмяМетаданных     = МетаданныеСправочника.ПолноеИмя();
	СтрокаПоля.ПредставлениеПоля = ПредставлениеПоля;
	СтрокаПоля.ТипГруппировки    = ТипГруппировкиКомпоновкиДанных.Иерархия;
	СтрокаПоля.Использование     = Истина;
	
	ИмяПоля           = "ЦФО";
	ПредставлениеПоля = НСтр("ru='ЦФО'");
	ДетализацияДокументов.Добавить(ИмяПоля, ПредставлениеПоля);
	СтрокаПоля = ПоляГруппировок.Добавить();
	СтрокаПоля.ИмяПоля           = ИмяПоля;
	СтрокаПоля.ИмяМетаданных     = Метаданные.Справочники.Подразделения.ПолноеИмя();
	СтрокаПоля.ПредставлениеПоля = ПредставлениеПоля;
	
	ИмяПоля           = "Организация";
	ПредставлениеПоля = НСтр("ru='Организация'");
	ДетализацияДокументов.Добавить(ИмяПоля, ПредставлениеПоля);
	СтрокаПоля = ПоляГруппировок.Добавить();
	СтрокаПоля.ИмяПоля           = ИмяПоля;
	СтрокаПоля.ИмяМетаданных     = Метаданные.Справочники.Организации.ПолноеИмя();
	СтрокаПоля.ПредставлениеПоля = ПредставлениеПоля;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеАналитики()
	
	Аналитики = бит_МеханизмДопИзмерений.Аналитики(Истина);
	Для каждого ОписаниеАналитики Из Аналитики Цикл
		Если НЕ ОписаниеАналитики.Используется Тогда
			Продолжить;
		КонецЕсли;
		
		ДетализацияДокументов.Добавить(ОписаниеАналитики.Имя, ОписаниеАналитики.Синоним);
		
		МетаданныеАналитки = ОписаниеАналитики.ЗначениеПоУмолчанию.Метаданные();
		СтрокаПоля         = ПоляГруппировок.Добавить();
		СтрокаПоля.ИмяПоля           = ОписаниеАналитики.Имя;
		СтрокаПоля.ИмяМетаданных     = МетаданныеАналитки.ПолноеИмя();
		СтрокаПоля.ПредставлениеПоля = ОписаниеАналитики.Синоним;
		Если ОписаниеАналитики.ЭтоСоставнойТип Тогда
			СтрокаПоля.ЭтоСоставнойТип   = ОписаниеАналитики.ЭтоСоставнойТип;
			СтрокаПоля.ТипСостовногоПоля = ОписаниеАналитики.ТипЗначения;
			ИспользуютсяСоставныеАналитики = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОбновитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьБюджетКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьБюджетКлиент(ПослеФормированияДокументов = Ложь)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПослеФормированияДокументов Тогда
		ЗапомнитьПараметрыПриФормированииОтчета();
	КонецЕсли;
	
	ЗапуститьЗамерДлительностиКлючевойОперации("ОбновлениеСводногоБюджета");
	
	ДлительнаяОперация = ПараметрыОбновленияБюджета();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru='Заполнение таблицы';en='Filling table'");  
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПослеФормированияДокументов", ПослеФормированияДокументов);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииОбновленияБюджета", ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьПараметрыПриФормированииОтчета()
	
	ЗначенияПриФормированииОтчета = Новый Структура;
	ЗначенияПриФормированииОтчета.Вставить("Валюта");
	ЗначенияПриФормированииОтчета.Вставить("ВариантВывода");
	ЗначенияПриФормированииОтчета.Вставить("ВыводитьКоличество");
	ЗначенияПриФормированииОтчета.Вставить("ВыводитьСумму");
	ЗначенияПриФормированииОтчета.Вставить("ОтборБюджет");
	ЗначенияПриФормированииОтчета.Вставить("Сценарий");
	ЗначенияПриФормированииОтчета.Вставить("ИспользоватьКоэффициентыСтатей");
	
	ЗаполнитьЗначенияСвойств(ЗначенияПриФормированииОтчета, ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(ЗначенияПриФормированииОтчета, Объект);
	
КонецПроцедуры

// Процедура окончание процедуры "ОбновитьБюджетКлиент".
//
&НаКлиенте
Процедура ПриЗавершенииОбновленияБюджета(ПараметрыРезультата, ДополнительныеПараметры) Экспорт
	
	Если ПараметрыРезультата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыРезультата.Статус = "Ошибка" Тогда
		// Ничего не делать или обработать ошибку.
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("en='Error during execution of %1';ru='Ошибка при выполнении: %1'"), 
		ПараметрыРезультата.КраткоеПредставлениеОшибки));
	Иначе
		ПриЗавершенииОбновленияБюджетаНаСервере(ПараметрыРезультата, ДополнительныеПараметры);
	КонецЕсли;
	
	ЗафиксироватьДлительностьКлючевойОперации();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗавершенииОбновленияБюджетаНаСервере(ПараметрыРезультата, ДополнительныеПараметры)
	
	Буфер = Неопределено;
	Бюджет.Очистить();
	
	СтруктураРезультатаОбновления = ПолучитьИзВременногоХранилища(ПараметрыРезультата.АдресРезультата);
	
	Результат                     = СтруктураРезультатаОбновления.РезультатТабличныйДокумент;
	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь;
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения =
			ДополнительныйРежимОтображения.НеИспользовать;
			
	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(СтруктураРезультатаОбновления.ДанныеРасшифровки,
														УникальныйИдентификатор);
	ТаблицаИерархии.Загрузить(СтруктураРезультатаОбновления.ТаблицаИерархии);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураРезультатаОбновления,
							"СтрокаОбщиеИтоги, КолонкаИтогСумма, КолонкаИтогКоличество");
							
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
	Если ДополнительныеПараметры.ПослеФормированияДокументов
		И ОтборСозданныеДокументы.Количество() > 0 Тогда
		ТекущийЭлемент = Элементы.СозданныеДокументы;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОбновленияБюджета()

	НаименованиеЗадания = НСтр("ru='Заполнение сводного бюджета.'");
	ВыполняемыйМетод = "Обработки.бит_СводныйБюджет.ЗаполнитьСводныйБюджет";
	
	НастройкиПараметров = НастройкаПараметровЗаполненияСводногоБюджета();
	
	// Заполнение параметров длительной операции.
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	Если ВыполнятьНаКлиенте Тогда
		ПараметрыВыполнения.ЗапуститьВФоне   = Ложь;
		ПараметрыВыполнения.ЗапуститьНеВФоне = Истина;
	КонецЕсли;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, НастройкиПараметров, ПараметрыВыполнения);

КонецФункции

&НаСервере
Функция НастройкаПараметровЗаполненияСводногоБюджета()
	
	ПараметрыЗаполнения	= Обработки.бит_СводныйБюджет.НовыеПараметрыЗаполненияСводногоБюджета();
	
	ПараметрыЗаполнения.НастройкиКомпоновщика = Объект.Компоновщик.Настройки;
	ПараметрыЗаполнения.СхемаКомпоновкиДанных = Обработки.бит_СводныйБюджет.ПриведеннаяСхемаКомпоновки();
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, Объект);
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ЭтотОбъект,
		"ВыводитьСумму, ВыводитьКоличество, ВыводитьКодификатор, Сортировка, ИспользоватьКоэффициентыСтатей");
	ПараметрыЗаполнения.Периодичность   = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЗаполнения.Сценарий,
																					"бит_Периодичность");
	ПараметрыЗаполнения.ПоляГруппировок = ПоляГруппировок.Выгрузить();
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// Процедура окончание процедуры "ЗафиксироватьБюджет".
//
&НаКлиенте
Процедура ПриЗавершенииФормированияДокументов(ПараметрыРезультата, ДополнительныеПараметры) Экспорт
	
	Если ПараметрыРезультата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьБюджет = Ложь;
	Если ПараметрыРезультата.Статус = "Ошибка" Тогда
		// Ничего не делать или обработать ошибку.
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(НСтр("en='Error during execution of %1';ru='Ошибка при выполнении: %1'"), 
			ПараметрыРезультата.КраткоеПредставлениеОшибки));
	Иначе
		ПриЗавершенииФормированияДокументовНаСервере(ПараметрыРезультата);
		ОбновитьБюджет = Истина;
	КонецЕсли;
	
	ЗафиксироватьДлительностьКлючевойОперации();
	
	Если ОбновитьБюджет Тогда
		ОбновитьБюджетКлиент(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗавершенииФормированияДокументовНаСервере(ПараметрыРезультата)
	
    Бюджет.Очистить();
	
	СтруктураРезультатаОбновления = ПолучитьИзВременногоХранилища(ПараметрыРезультата.АдресРезультата);
	ОтборСозданныеДокументы       = СтруктураРезультатаОбновления.СозданныеДокументы;
	
	УстановитьОтборСозданныхДокументов();
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФормированияБюджетныхОпераций()

	НаименованиеЗадания = НСтр("ru='Формирование документов.'");
	ВыполняемыйМетод = "Обработки.бит_СводныйБюджет.СформироватьБюджетныеОперации";
	
	НастройкиПараметров = НастройкаПараметровФормированияБюджетныхОпераций();
	
	// Заполнение параметров длительной операции.
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	Если ВыполнятьНаКлиенте Тогда
		ПараметрыВыполнения.ЗапуститьВФоне   = Ложь;
		ПараметрыВыполнения.ЗапуститьНеВФоне = Истина;
	КонецЕсли;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, НастройкиПараметров, ПараметрыВыполнения);

КонецФункции

&НаСервере
Функция НастройкаПараметровФормированияБюджетныхОпераций()
	
	ПараметрыЗаполнения	= Обработки.бит_СводныйБюджет.НовыеПараметрыФормированияБюджетныхОпераций();
	
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, Объект);
	ПараметрыЗаполнения.ТаблицаБюджта = Бюджет.Выгрузить();
	
	Если РазбиватьДокументыПоАналитикам Тогда
		Для каждого ЭлементДетализации Из ДетализацияДокументов Цикл
			Если НЕ ЭлементДетализации.Пометка Тогда
				Продолжить;
			КонецЕсли;
			ПараметрыЗаполнения.АналитикиДетализации.Добавить(ЭлементДетализации.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// Процедура открывает форму выбора периода.
// 
// Параметры:
//  Период  - Стандартный период
// 
&НаКлиенте
Процедура ВыборПериода(Период)

	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Период;
	
	Оповещение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

// Процедура выбора периода 
// 
&НаКлиенте 
Процедура ВыборПериодаЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
	
		Объект.Период = РезультатВыбора;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ДанныеРасшифровкиПоля(ПараметрыОбласти)
	
	ДанныеРасшифровкиПоля = Новый Структура;
	ДанныеРасшифровкиПоля.Вставить("НомерСтроки",            0);
	ДанныеРасшифровкиПоля.Вставить("НомерКолонки",           0);
	ДанныеРасшифровкиПоля.Вставить("НомерКолонкиИтоговПоГоризонтали", 0);
	ДанныеРасшифровкиПоля.Вставить("Значение",               Неопределено);
	ДанныеРасшифровкиПоля.Вставить("ЭтоГруппа",              Ложь);
	ДанныеРасшифровкиПоля.Вставить("ЭтоРесурс",              Ложь);
	ДанныеРасшифровкиПоля.Вставить("ЭтоСумма",               Ложь);
	ДанныеРасшифровкиПоля.Вставить("ЭтоКоличество",          Ложь);
	ДанныеРасшифровкиПоля.Вставить("ЭтоИтоги",               Ложь);
	ДанныеРасшифровкиПоля.Вставить("Расшифровка",            Неопределено);
	ДанныеРасшифровкиПоля.Вставить("Иерархия",               Новый Массив);
	ДанныеРасшифровкиПоля.Вставить("ПоляРасшифровки",        Новый Структура);
	ДанныеРасшифровкиПоля.Вставить("ИдентификаторЯчейки",    0);
	ДанныеРасшифровкиПоля.Вставить("ДоступнаРаботаСБуфером", Ложь);
	
	Если ПараметрыОбласти <> Неопределено Тогда
		ИмяОбласти = ПараметрыОбласти.Имя;
		Попытка
			ПозицияРазделителя = СтрНайти(ИмяОбласти, "C");
			НомерСтроки        = Число(Сред(ИмяОбласти, 2, ПозицияРазделителя - 2));
			НомерКолонки       = Число(Сред(ИмяОбласти, ПозицияРазделителя + 1));
		Исключение
			НомерСтроки  = 0;
			НомерКолонки = 0;
		КонецПопытки;
		ДанныеРасшифровкиПоля.НомерСтроки  = НомерСтроки;
		ДанныеРасшифровкиПоля.НомерКолонки = НомерКолонки;
		ДанныеРасшифровкиПоля.Расшифровка  = ПараметрыОбласти.Расшифровка;
		
		Если НомерСтроки = СтрокаОбщиеИтоги
			ИЛИ НомерКолонки = КолонкаИтогСумма
			ИЛИ НомерКолонки = КолонкаИтогКоличество Тогда
			ДанныеРасшифровкиПоля.ЭтоИтоги = Истина;
		КонецЕсли;
		
		ДополнитьДанныеРасшифровкиПоляНаСервере(ДанныеРасшифровкиПоля);
		
		ИдентификаторЯчейки = ПараметрыОбласти.Расшифровка;
		Если ДанныеРасшифровкиПоля.ЭтоКоличество
			И ВыводитьСумму Тогда
			ОбластьСуммы        = Результат.Область(НомерСтроки, НомерКолонки - 1);
			ИдентификаторЯчейки = ОбластьСуммы.Расшифровка;
		КонецЕсли;
		ДанныеРасшифровкиПоля.ИдентификаторЯчейки = Число(ИдентификаторЯчейки);
	КонецЕсли;
	
	Если НЕ ДанныеРасшифровкиПоля.ЭтоИтоги
		И ДанныеРасшифровкиПоля.ЭтоРесурс Тогда
		ДанныеРасшифровкиПоля.ДоступнаРаботаСБуфером = Истина;
	КонецЕсли;
	
	Возврат ДанныеРасшифровкиПоля;
	
КонецФункции

&НаСервере
Процедура ДополнитьДанныеРасшифровкиПоляНаСервере(ДанныеРасшифровкиПоля)

	Данные      = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Расшифровка = ДанныеРасшифровкиПоля.Расшифровка;
	
	Иерархии = РеквизитФормыВЗначение("ТаблицаИерархии");
	Запрос   = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаИерархии.Группа КАК Группа,
	|	ТаблицаИерархии.Начало КАК Начало,
	|	ТаблицаИерархии.Окончание КАК Окончание
	|ПОМЕСТИТЬ ТаблицаИерархии
	|ИЗ
	|	&ТаблицаИерархии КАК ТаблицаИерархии";
	Запрос.УстановитьПараметр("ТаблицаИерархии", Иерархии);
	Запрос.Выполнить();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаИерархии.Группа КАК Группа
	|ИЗ
	|	ТаблицаИерархии КАК ТаблицаИерархии
	|ГДЕ
	|	ТаблицаИерархии.Группа = &НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаИерархии.Группа КАК Группа
	|ИЗ
	|	ТаблицаИерархии КАК ТаблицаИерархии
	|ГДЕ
	|	ТаблицаИерархии.Начало <= &НомерСтроки
	|	И ТаблицаИерархии.Окончание >= &НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Группа";
	Запрос.УстановитьПараметр("НомерСтроки", ДанныеРасшифровкиПоля.НомерСтроки);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ДанныеРасшифровкиПоля.ЭтоГруппа = НЕ МассивРезультатов[0].Пустой();
	ДанныеРасшифровкиПоля.Иерархия  = МассивРезультатов[1].Выгрузить().ВыгрузитьКолонку("Группа");
	ДанныеРасшифровкиПоля.Иерархия.Добавить(СтрокаОбщиеИтоги);
	
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
		ЭлементРасшифровки = Данные.Элементы[Расшифровка];
		Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			Для каждого ЭлементРасшифровкиПоля Из ЭлементРасшифровки.ПолучитьПоля() Цикл
				ДанныеРасшифровкиПоля.Значение = ЭлементРасшифровкиПоля.Значение;
				
				Если ЭлементРасшифровкиПоля.Поле = "Сумма" Тогда
					ДанныеРасшифровкиПоля.ЭтоСумма                        = Истина;
					ДанныеРасшифровкиПоля.ЭтоРесурс                       = Истина;
					ДанныеРасшифровкиПоля.НомерКолонкиИтоговПоГоризонтали = КолонкаИтогСумма;
				ИначеЕсли ЭлементРасшифровкиПоля.Поле = "Количество" Тогда
					ДанныеРасшифровкиПоля.ЭтоКоличество                   = Истина;
					ДанныеРасшифровкиПоля.ЭтоРесурс                       = Истина;
					ДанныеРасшифровкиПоля.НомерКолонкиИтоговПоГоризонтали = КолонкаИтогКоличество;
				КонецЕсли;
			КонецЦикла;
			
			Если ДанныеРасшифровкиПоля.ЭтоРесурс Тогда
				ЗаполнитьПоляРасшифровки(ДанныеРасшифровкиПоля, ЭлементРасшифровки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляРасшифровки(ДанныеРасшифровкиПоля, ЭлементРасшифровки)
	
	Для каждого ЭлементРасшифровкиРодителя Из ЭлементРасшифровки.ПолучитьРодителей() Цикл
		Если ТипЗнч(ЭлементРасшифровкиРодителя) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			Для каждого ЗначениеПоляРасшифровки Из ЭлементРасшифровкиРодителя.ПолучитьПоля() Цикл
				ПоляРасшифровки = ДанныеРасшифровкиПоля.ПоляРасшифровки;
				
				ИмяПоля      = ЗначениеПоляРасшифровки.Поле;
				ЗначенияПоля = ЗначениеПоляРасшифровки.Значение;
				Если ИмяПоля = "СтатьяБюджета" Тогда
					ИмяПоляОборотов      = "СтатьяОборотов";
					ЗначенияПоляОборотов = СтатьяОборотовСтатиБюджета(ЗначенияПоля);
					Если НЕ ПоляРасшифровки.Свойство(ИмяПоляОборотов) Тогда
						ПоляРасшифровки.Вставить(ИмяПоляОборотов, ЗначенияПоляОборотов);
					КонецЕсли;
				КонецЕсли;
				
				Если НЕ ПоляРасшифровки.Свойство(ИмяПоля) Тогда
					ПоляРасшифровки.Вставить(ИмяПоля, ЗначенияПоля);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ЗаполнитьПоляРасшифровки(ДанныеРасшифровкиПоля, ЭлементРасшифровкиРодителя);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьЗначениеОбласти(ТекущаяОбласть, Дельта)
	
	ТекущееЗначение = ЗначениеТекстаЯчейки(ТекущаяОбласть) + Дельта;
	ТекущаяОбласть.Текст = ТекущееЗначение;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеТекстаЯчейки(ТекущаяОбласть)
	
	ТекущееЗначение = 0;
	
	ТекущийТекстЯчейки = ТекущаяОбласть.Текст;
	Если ПустаяСтрока(ТекущийТекстЯчейки) Тогда
		Возврат ТекущееЗначение;
	КонецЕсли;
	
	Попытка
		ТекущееЗначение = Число(ТекущийТекстЯчейки);
	Исключение
		ТекстСообщения = НСтр("ru='Не удалось получить значение ячейки';
			|en='Не удалось получить значение ячейки'");
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		#Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		#КонецЕсли
	КонецПопытки;
	
	Возврат ТекущееЗначение; 
	
КонецФункции

&НаСервереБезКонтекста
Функция НовыеПараметрыРедактированияБюджета()
	
	ПараметрыРедактирования = Новый Структура;
	
	ПараметрыРедактирования.Вставить("Период",               '00010101');
	ПараметрыРедактирования.Вставить("СтатьяОборотов",       Справочники.бит_СтатьиОборотов.ПустаяСсылка());
	ПараметрыРедактирования.Вставить("Валюта",               Справочники.Валюты.ПустаяСсылка());
	ПараметрыРедактирования.Вставить("Сценарий",             Справочники.СценарииПланирования.ПустаяСсылка());
	ПараметрыРедактирования.Вставить("ЦФО",                  Справочники.Подразделения.ПустаяСсылка());
	ПараметрыРедактирования.Вставить("Организация",          Справочники.Организации.ПустаяСсылка());
	ПараметрыРедактирования.Вставить("ТекущийБюджет",        0);
	ПараметрыРедактирования.Вставить("АдресБюджет",          "");
	
	Аналитики = бит_МеханизмДопИзмерений.Аналитики(Истина);
	Для каждого ОписаниеАналитики Из Аналитики Цикл
		ПараметрыРедактирования.Вставить(ОписаниеАналитики.Имя, ОписаниеАналитики.ЗначениеПоУмолчанию);
	КонецЦикла;
	
	Возврат ПараметрыРедактирования;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыТекущихПравокБюджета(ПараметрыРедактированияБюджета, ИдентификаторЯчейки)
	
	СтрокиБюджета  = Бюджет.НайтиСтроки(Новый Структура("ИдентификаторЯчейки", ИдентификаторЯчейки));
	ТаблицаБюджета = Бюджет.Выгрузить(СтрокиБюджета);
	
	ПараметрыРедактированияБюджета.АдресБюджет = ПоместитьВоВременноеХранилище(ТаблицаБюджета, УникальныйИдентификатор);
	
КонецПроцедуры

// Завершает изменение бюджета.
//
// Параметры:
//	РезультатРедактирования - Структура - Возвращаемое значение из формы РедактированиеБюджета.
//	ДополнительныеПараметры - Произвольный - Дополнительные параметры описания оповещения.
//
&НаКлиенте
Процедура РедактированиеБюджетаЗавершение(РезультатРедактирования, ДанныеРасшифровкиПоля) Экспорт
	
	Если РезультатРедактирования = Неопределено
		ИЛИ РезультатРедактирования = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьТаблицуБюджета(РезультатРедактирования.ТаблицаБюджета, ДанныеРасшифровкиПоля);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуБюджета(НоваяТаблицаБюджета, ДанныеРасшифровкиПоля, ЗаменятьСтарыеЗначения = Истина)
	
	Если ТипЗнч(НоваяТаблицаБюджета) = Тип("ТаблицаЗначений") Тогда
		ТаблицаБюджета = НоваяТаблицаБюджета;
	ИначеЕсли ТипЗнч(НоваяТаблицаБюджета) = Тип("Строка")
		И ЭтоАдресВременногоХранилища(НоваяТаблицаБюджета) Тогда
		ТаблицаБюджета = ПолучитьИзВременногоХранилища(НоваяТаблицаБюджета);
	Иначе
		Возврат; 
	КонецЕсли;
	
	ТекущееКоличество   = 0;
	ТекущаяСумма        = 0;
	ИдентификаторЯчейки = ДанныеРасшифровкиПоля.ИдентификаторЯчейки;
	СтрокиБюджета       = Бюджет.НайтиСтроки(Новый Структура("ИдентификаторЯчейки", ИдентификаторЯчейки));
	Для каждого СтрокаБюджета Из СтрокиБюджета Цикл
		ТекущееКоличество = ТекущееКоличество + СтрокаБюджета.Количество;
		ТекущаяСумма      = ТекущаяСумма + СтрокаБюджета.Сумма;
		Если ЗаменятьСтарыеЗначения Тогда
			Бюджет.Удалить(СтрокаБюджета);
		КонецЕсли;
	КонецЦикла;
	
	НовоеКоличество = ?(ЗаменятьСтарыеЗначения, 0, ТекущееКоличество);
	НоваяСумма      = ?(ЗаменятьСтарыеЗначения, 0, ТекущаяСумма);
	Для каждого СтрокаБюджета Из ТаблицаБюджета Цикл
		НоваяСтрока = Бюджет.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаБюджета);
		НоваяСтрока.ИдентификаторЯчейки = ИдентификаторЯчейки;
		НовоеКоличество = НовоеКоличество + СтрокаБюджета.Количество;
		НоваяСумма      = НоваяСумма + СтрокаБюджета.Сумма;
	КонецЦикла;
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
	ИзменениеКоличества = НовоеКоличество - ТекущееКоличество;
	ИзменениеСуммы      = НоваяСумма - ТекущаяСумма;
	Если ИспользоватьКоэффициентыСтатей
		И ФормироватьВРазрезеБюджета(Объект.ВариантВывода) Тогда
		СтатьяБюджета = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеРасшифровкиПоля.ПоляРасшифровки,
							"СтатьяБюджета");
		Если ЗначениеЗаполнено(СтатьяБюджета) Тогда
			Коэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяБюджета, "Коэффициент");
			Если Коэффициент <> 0 Тогда
				ИзменениеКоличества = ИзменениеКоличества * Коэффициент;
				ИзменениеСуммы      = ИзменениеСуммы * Коэффициент;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ВыводитьСумму Тогда
		НомерКолонки                    = ДанныеРасшифровкиПоля.НомерКолонки;
		НомерКолонкиИтоговПоГоризонтали = ДанныеРасшифровкиПоля.НомерКолонкиИтоговПоГоризонтали;
		Если ДанныеРасшифровкиПоля.ЭтоКоличество Тогда
			НомерКолонки                    = НомерКолонки - 1;
			НомерКолонкиИтоговПоГоризонтали = НомерКолонкиИтоговПоГоризонтали - 1;
		КонецЕсли;
		Дельта = ИзменениеСуммы;
		ИзменитьЗначениеПоказателя(ДанныеРасшифровкиПоля,
									Дельта,
									НомерКолонки,
									НомерКолонкиИтоговПоГоризонтали);
	КонецЕсли;
	Если ВыводитьКоличество Тогда
		НомерКолонки                    = ДанныеРасшифровкиПоля.НомерКолонки;
		НомерКолонкиИтоговПоГоризонтали = ДанныеРасшифровкиПоля.НомерКолонкиИтоговПоГоризонтали;
		Если ДанныеРасшифровкиПоля.ЭтоСумма Тогда
			НомерКолонки                    = НомерКолонки + 1;
			НомерКолонкиИтоговПоГоризонтали = НомерКолонкиИтоговПоГоризонтали + 1;
		КонецЕсли;
		Дельта = ИзменениеКоличества;
		ИзменитьЗначениеПоказателя(ДанныеРасшифровкиПоля,
									Дельта,
									НомерКолонки,
									НомерКолонкиИтоговПоГоризонтали);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗначениеПоказателя(ДанныеРасшифровкиПоля, Дельта, НомерКолонки, НомерКолонкиИтоговПоГоризонтали)
	
	Если Дельта = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяОбласть = Результат.Область(ДанныеРасшифровкиПоля.НомерСтроки, НомерКолонки);
	ИзменитьЗначениеОбласти(ТекущаяОбласть, Дельта);
	ОбластьЯчеекИтогов = Результат.Область(ДанныеРасшифровкиПоля.НомерСтроки,
											НомерКолонкиИтоговПоГоризонтали);
	ИзменитьЗначениеОбласти(ОбластьЯчеекИтогов, Дельта);
	УтановитьОформлениеОбласти(ТекущаяОбласть, "ИзмененоЗначение");
	
	Для каждого НомерСтрокиГруппы Из ДанныеРасшифровкиПоля.Иерархия Цикл
		ОбластьЯчеекГруппы = Результат.Область(НомерСтрокиГруппы, НомерКолонки);
		ИзменитьЗначениеОбласти(ОбластьЯчеекГруппы, Дельта);
		
		ОбластьЯчеекИтогов = Результат.Область(НомерСтрокиГруппы, НомерКолонкиИтоговПоГоризонтали);
		ИзменитьЗначениеОбласти(ОбластьЯчеекИтогов, Дельта);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВыделениеЯчейкиБуфера(Выделить = Истина)
	
	Если Буфер = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьБуфера = Результат.Область(Буфер.Имя);
	Если Выделить Тогда
		УтановитьОформлениеОбласти(ОбластьБуфера, "ГраницыКопируемойОбласти");
	Иначе
		УтановитьОформлениеОбласти(ОбластьБуфера, "ГраницыОбластиПоУмолчанию");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УтановитьОформлениеОбласти(ТекущаяОбласть, ВариантОформления)
	
	ПараметрыОформления = ПараметрыОформленияЯчеек(ВариантОформления);
	Для каждого ЭлементОформления Из ПараметрыОформления Цикл 
		ЗначениеОформления = ЭлементОформления.Значение;
		Если ЗначениеОформления = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяОбласть[ЭлементОформления.Ключ] = ЗначениеОформления;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОформленияЯчеек(ВариантОформления)
	
	ПараметрыОформления = Новый Структура;
	
	Если ВариантОформления = "ИзмененоЗначение" Тогда
		ПараметрыОформления.Вставить("ЦветФона", ЦветФонаИзмененногоЗначения);
	ИначеЕсли ВариантОформления = "ГраницыКопируемойОбласти" Тогда
		Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.БольшойПунктир, 2);
		ПараметрыОформления.Вставить("ЦветРамки",     ЦветРамкиКопируемогоЗначения);
		ПараметрыОформления.Вставить("ГраницаСверху", Линия);
		ПараметрыОформления.Вставить("ГраницаСлева",  Линия);
		ПараметрыОформления.Вставить("ГраницаСнизу",  Линия);
		ПараметрыОформления.Вставить("ГраницаСправа", Линия);
	ИначеЕсли ВариантОформления = "ГраницыОбластиПоУмолчанию" Тогда
		Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		ПараметрыОформления.Вставить("ЦветРамки",     Новый Цвет);
		ПараметрыОформления.Вставить("ГраницаСверху", Линия);
		ПараметрыОформления.Вставить("ГраницаСлева",  Линия);
		ПараметрыОформления.Вставить("ГраницаСнизу",  Линия);
		ПараметрыОформления.Вставить("ГраницаСправа", Линия);
	КонецЕсли;
	
	Возврат ПараметрыОформления;
	
КонецФункции

&НаСервере
Процедура ИнициализароватьКомпоновщик()
	
	Если КомпоновщикИнициализирован Тогда
		Возврат;
	КонецЕсли;
	
	СхемаКомпоновкиДанных = Обработки.бит_СводныйБюджет.ПриведеннаяСхемаКомпоновки();
	Настройки             = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	АдресСКД              = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	Объект.Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
	Объект.Компоновщик.ЗагрузитьНастройки(Настройки);
		
	КомпоновщикИнициализирован = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСозданныхДокументов()
	
	СозданныеДокументы.Параметры.УстановитьЗначениеПараметра("ОтборСозданныеДокументы", ОтборСозданныеДокументы);
	Элементы.СозданныеДокументы.Видимость = (ОтборСозданныеДокументы.Количество() > 0);
	
КонецПроцедуры

&НаКлиенте
Функция ВыделенныеОбласти()
	
	ВыделенныеОбласти = Новый Массив;
	
	ТекущаяОбласть = Элементы.Результат.ТекущаяОбласть;
	Если ТекущаяОбласть = Неопределено Тогда
		Возврат ВыделенныеОбласти;
	КонецЕсли;
	
	Для НомерКолонки = ТекущаяОбласть.Лево По ТекущаяОбласть.Право Цикл
		Для НомерСтроки = ТекущаяОбласть.Верх По ТекущаяОбласть.Низ Цикл
			ОбластьРезультата = Результат.Область(НомерСтроки, НомерКолонки);
			
			ПараметрыОбласти = Новый Структура("Имя, Расшифровка, Текст");
			ЗаполнитьЗначенияСвойств(ПараметрыОбласти, ОбластьРезультата);
			
			ВыделенныеОбласти.Добавить(ПараметрыОбласти);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ВыделенныеОбласти;
	
КонецФункции

&НаСервере
Процедура ВставитьДанныеИзБуфераВОбласть(ВыделенныеОбласти)
	
	Если Буфер = Неопределено ИЛИ ВыделенныеОбласти.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРасшифровкиИсточника = ДанныеРасшифровкиПоля(Буфер);
	Если НЕ ПараметрыРасшифровкиИсточника.ДоступнаРаботаСБуфером Тогда
		Возврат;
	КонецЕсли;
	
	ПарамемтрыЗаполнения          = Обработки.бит_СводныйБюджет.НовыеПараметрыЗаполненияДанныхБюджетаПоАналитикам();
	ПарамемтрыЗаполнения.Сценарий = Объект.Сценарий;
	ПарамемтрыЗаполнения.Валюта   = Объект.Валюта;
	
	Для каждого ЭлементРасшифровки Из ПараметрыРасшифровкиИсточника.ПоляРасшифровки Цикл
		Если ЭлементРасшифровки.Ключ = "Период" Тогда
			Периодичность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Сценарий, "бит_Периодичность");
			ПараметрыДаты = Перечисления.бит_ПериодичностьПланирования.ПараметрыДатыПоПериодичности(ЭлементРасшифровки.Значение,
																						Периодичность);
			ПарамемтрыЗаполнения.НачалоПериода    = ПараметрыДаты.ДатаНачала;
			ПарамемтрыЗаполнения.ОкончаниеПериода = ПараметрыДаты.ДатаОкончания;
		Иначе
			ПарамемтрыЗаполнения.Аналитики.Вставить(ЭлементРасшифровки.Ключ, ЭлементРасшифровки.Значение);
		КонецЕсли;
	КонецЦикла;
	
	СтрокиБюджета  = Бюджет.НайтиСтроки(Новый Структура("ИдентификаторЯчейки",
										ПараметрыРасшифровкиИсточника.ИдентификаторЯчейки));
	ТаблицаБюджета = Бюджет.Выгрузить(СтрокиБюджета);
	
	ПарамемтрыЗаполнения.ТаблицаИзменений = ТаблицаБюджета;
	ТаблицаИсточник = ТаблицаБюджета.СкопироватьКолонки();
	
	Обработки.бит_СводныйБюджет.ЗаполнитьДанныеБюджетаПоАналитикам(ТаблицаИсточник, ПарамемтрыЗаполнения);
	
	Для каждого ОбластьВставки Из ВыделенныеОбласти Цикл 
		ПараметрыРасшифровкиПриемника = ДанныеРасшифровкиПоля(ОбластьВставки);
		Если НЕ ПараметрыРасшифровкиПриемника.ДоступнаРаботаСБуфером Тогда
			Возврат;
		КонецЕсли;
		
		КопияТаблицыИсточника = ТаблицаИсточник.Скопировать();
		Для каждого СтрокаИсточника Из КопияТаблицыИсточника Цикл
			СтрокаИсточника.ИдентификаторЯчейки = ПараметрыРасшифровкиПриемника.ИдентификаторЯчейки;
			ЗаполнитьЗначенияСвойств(СтрокаИсточника, ПараметрыРасшифровкиПриемника.ПоляРасшифровки); 
		КонецЦикла;
		ОбновитьТаблицуБюджета(КопияТаблицыИсточника, ПараметрыРасшифровкиПриемника, Ложь);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОграниченияОтборов()
	
	УстановитьНастройкуГруппировкиСтатьи();
	
	НастройкаПолей        = РеквизитФормыВЗначение("ПоляГруппировок");
	СхемаКомпоновкиДанных = Обработки.бит_СводныйБюджет.ПриведеннаяСхемаКомпоновки(НастройкаПолей);
	АдресСКД              = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	Объект.Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкуГруппировкиСтатьи()
	
	Если ПоляГруппировок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоля               = "";
	ИмяЗаменяемогоПоля    = "";
	МетаданныеСправочника = Неопределено;
	Если ФормироватьВРазрезеБюджета(Объект.ВариантВывода) Тогда
		ИмяПоля               = "СтатьяБюджета";
		ИмяЗаменяемогоПоля    = "СтатьяОборотов";
		МетаданныеСправочника = Метаданные.Справочники.бит_СтатьиБюджета;
	Иначе
		ИмяПоля               = "СтатьяОборотов";
		ИмяЗаменяемогоПоля    = "СтатьяБюджета";
		МетаданныеСправочника = Метаданные.Справочники.бит_СтатьиОборотов;
	КонецЕсли;
	
	Для каждого ПолеГруппировки Из ПоляГруппировок Цикл
		Если ПолеГруппировки.ИмяПоля = ИмяПоля Тогда
			Возврат;
		ИначеЕсли ПолеГруппировки.ИмяПоля = ИмяЗаменяемогоПоля Тогда
			ПолеГруппировки.ИмяПоля           = ИмяПоля;
			ПолеГруппировки.ИмяМетаданных     = МетаданныеСправочника.ПолноеИмя();
			ПолеГруппировки.ПредставлениеПоля = ОбщегоНазначения.ПредставлениеОбъекта(МетаданныеСправочника);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоказателяОтчета(Элемент)
	
	Если ЗначенияПриФормированииОтчета = Неопределено Тогда
		ПриИзмененииПоказателяОтчетаЗавершение();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ВопросИзменитьЗначениеПоказателяПриЗавершении", ЭтотОбъект, Элемент);
		ТекстВопроса = НСтр("ru='Изменение параметров отчета приведет к потере внесенных правок бюджета. Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоказателяОтчетаЗавершение()
	
	УстановитьОграниченияОтборов();
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросИзменитьЗначениеПоказателяПриЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Бюджет.Очистить();
		Элементы.Результат.ОтображениеСостояния.Текст =
			НСтр("ru='Изменились настройки. Нажмите ""Обновить"" для отображения сводного бюджета.'");
		Элементы.Результат.ОтображениеСостояния.Видимость = Истина;
		Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения =
			ДополнительныйРежимОтображения.Неактуальность;
		ЗначенияПриФормированииОтчета = Неопределено;
		Если ДополнительныеПараметры = Элементы.Сценарий Тогда
			СценарийПриИзмененииНаСервере();
		ИначеЕсли ДополнительныеПараметры = Элементы.ВариантВывода Тогда
			ПриИзмененииПоказателяОтчетаЗавершение();
		КонецЕсли;
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияПриФормированииОтчета);
		ЗаполнитьЗначенияСвойств(Объект, ЗначенияПриФормированииОтчета);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КоллекцияВыбораСоставногоТипа(ТипСостовногоПоля)
	
	ТипыПоля = Новый Массив;
		
	ТипыСоставногоПоля = ТипСостовногоПоля.Типы();
	Для каждого ТипПоля Из ТипыСоставногоПоля Цикл
		МетаданныеТипа = Метаданные.НайтиПоТипу(ТипПоля);
		Если МетаданныеТипа = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТипыПоля.Добавить(МетаданныеТипа.ПолноеИмя());
	КонецЦикла;
	
	Возврат ТипыПоля;
	
КонецФункции

#Область РаботаСНастройками

&НаКлиенте
Процедура ВыполнитьСохранениеНастроек(ПриЗакрытии = Ложь)
	
	ПараметрыФормы     = Новый Структура;
	СтруктураНастройки = СохраняемыеНастройкиОтчета();
	ПараметрыФормы.Вставить("СтруктураНастройки",  СтруктураНастройки);
	ПараметрыФормы.Вставить("ТипНастройки",
		ПредопределенноеЗначение("Перечисление.бит_ТипыСохраненныхНастроек.Обработки"));
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", НастраиваемыйОбъект());
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		ПараметрыФормы.Вставить("СохраненнаяНастройка", ТекущаяНастройка);
	КонецЕсли; 
	
	ПараметрыСохранения = Новый Структура;
	ПараметрыСохранения.Вставить("ПриЗакрытии", ПриЗакрытии);
	Оповещение = Новый ОписаниеОповещения("СохранитьНастройкиЗавершение", ЭтотОбъект, ПараметрыСохранения);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", ПараметрыФормы, ЭтотОбъект,,,,
		Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовыеСохраняемыеНастройки()
	
	СтруктураНастройки = Новый Структура;
	
	СтруктураНастройки.Вставить("АналитикиДетализацииДокументов", Новый Массив);
	СтруктураНастройки.Вставить("Валюта",                         Справочники.Валюты.ПустаяСсылка());
	СтруктураНастройки.Вставить("ВариантВывода",                  0);
	СтруктураНастройки.Вставить("ВыводитьКоличество",             Ложь);
	СтруктураНастройки.Вставить("ВыводитьСумму",                  Истина);
	СтруктураНастройки.Вставить("ВыводитьКодификатор",            Истина);
	СтруктураНастройки.Вставить("ВыполнятьНаКлиенте",             Ложь);
	СтруктураНастройки.Вставить("ИспользоватьКоэффициентыСтатей", Ложь);
	СтруктураНастройки.Вставить("НастройкиКомпоновщика",          Неопределено);
	СтруктураНастройки.Вставить("ОтборБюджет",                    Справочники.бит_Бюджеты.ПустаяСсылка());
	СтруктураНастройки.Вставить("Период",                         Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотГод));
	СтруктураНастройки.Вставить("ПоляГруппировок",                Неопределено);
	СтруктураНастройки.Вставить("РазбиватьДокументыПоАналитикам", Ложь);
	СтруктураНастройки.Вставить("Сортировка",                     "Кодификатор");
	СтруктураНастройки.Вставить("Сценарий",                       Справочники.СценарииПланирования.ПустаяСсылка());

	Возврат СтруктураНастройки;
	
КонецФункции

&НаСервере
Функция СохраняемыеНастройкиОтчета()
	
	СтруктураНастройки = НовыеСохраняемыеНастройки();
	
	ЗаполнитьЗначенияСвойств(СтруктураНастройки, ЭтотОбъект,, "ПоляГруппировок");
	ЗаполнитьЗначенияСвойств(СтруктураНастройки, Объект);
	
	СтруктураНастройки.НастройкиКомпоновщика = Объект.Компоновщик.Настройки;
	
	ТаблицаПоляГруппировок = РеквизитФормыВЗначение("ПоляГруппировок"); 	
	СтруктураНастройки.ПоляГруппировок = бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(ТаблицаПоляГруппировок);
	
	АналитикиДетализацииДокументов = Новый Массив;
	Для каждого ЭлементДетализации Из ДетализацияДокументов Цикл
		Если НЕ ЭлементДетализации.Пометка Тогда
			Продолжить;
		КонецЕсли;
		АналитикиДетализацииДокументов.Добавить(ЭлементДетализации.Значение);
	КонецЦикла;
	СтруктураНастройки.АналитикиДетализацииДокументов = АналитикиДетализацииДокументов;
	
	Возврат СтруктураНастройки;
	
КонецФункции

&НаСервереБезКонтекста
Функция НастраиваемыйОбъект()
	
	Возврат Обработки.бит_СводныйБюджет.НаименованиеОбъектаСохраняемыхНастроек();
	
КонецФункции

// Процедура - обработчик оповещения о закрытии формы сохранения настроек. 
//
&НаКлиенте
Процедура СохранитьНастройкиЗавершение(РезультатСохранения, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатСохранения) Тогда
		ТекущаяНастройка = РезультатСохранения;
		УстановитьЗаголовокФормы();
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПриЗакрытии", Ложь) Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает заголовок формы.
//
&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		ЗаголовокФормы = НСтр("ru='Сводный бюджет (%1)'");
		ЗаголовокФормы = СтрШаблон(ЗаголовокФормы, ТекущаяНастройка);
	Иначе	
		ЗаголовокФормы = НСтр("ru='Сводный бюджет'");
	КонецЕсли; 
	Заголовок = ЗаголовокФормы;
	
КонецПроцедуры

// Процедура - обработчик оповещения о закрытии формы применения настроек. 
//
&НаКлиенте
Процедура ВыбратьНастройкиЗавершение(ВыбраннаяНастройка, ДополнительныеПараметры) Экспорт
	
	ТекущаяНастройка = ВыбраннаяНастройка;
	
	Если НЕ ЗначениеЗаполнено(ВыбраннаяНастройка) Тогда
		Возврат;
	КонецЕсли;
	
	ПрименитьНастройки(ВыбраннаяНастройка);
	ОбновитьБюджетКлиент();
	
КонецПроцедуры

// Функция применяет сохраненные настройки.
//
// Параметры:
//  ВыбраннаяНастройка  - СправочникСсылка.бит_СохраненныеНастройки.
//
&НаСервере
Процедура ПрименитьНастройки(ВыбраннаяНастройка)
	
	Если ЗначениеЗаполнено(ВыбраннаяНастройка) Тогда
		
		СтруктураНастроек    = НовыеСохраняемыеНастройки();
		СохраненнаяНастройка = ВыбраннаяНастройка.ХранилищеНастроек.Получить();
		Если ТипЗнч(СохраненнаяНастройка) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(СтруктураНастроек, СохраненнаяНастройка);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Объект, СтруктураНастроек);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураНастроек,, "ПоляГруппировок");
		
		ТаблицаПоляГруппировок = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(СтруктураНастроек.ПоляГруппировок);
		Если ТипЗнч(ТаблицаПоляГруппировок) = Тип("ТаблицаЗначений") Тогда
			Для каждого СтрокаНастройки Из ТаблицаПоляГруппировок Цикл
				Если НЕ СтрокаНастройки.Использование Тогда
					Продолжить;
				КонецЕсли;
				
				Отбор            = Новый Структура("ИмяПоля", СтрокаНастройки.ИмяПоля);
				СтрокиГруппирови = ПоляГруппировок.НайтиСтроки(Отбор);
				Для каждого СтрокаГруппировки Из СтрокиГруппирови Цикл
					СтрокаГруппировки.Использование = Истина;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
		Для каждого ИмяАналитики Из СтруктураНастроек.АналитикиДетализацииДокументов Цикл
			ЭлементДетализации = ДетализацияДокументов.НайтиПоЗначению(ИмяАналитики);
			Если ЭлементДетализации <> Неопределено Тогда
				ЭлементДетализации.Пометка = Истина;
			КонецЕсли;
		Конеццикла;
			
		Если ТипЗнч(СтруктураНастроек.НастройкиКомпоновщика) = Тип("НастройкиКомпоновкиДанных") Тогда
			Объект.Компоновщик.ЗагрузитьНастройки(СтруктураНастроек.НастройкиКомпоновщика);
		КонецЕсли;
		
	КонецЕсли; 
	
	УстановитьОграниченияОтборов();
	
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиПоУмолчанию()
	
	// Получим настройку по - умолчанию и последнюю использованную.
	НастройкаПоУмолчанию = НастройкаПоУмолчанию();
	
	Если ЗначениеЗаполнено(НастройкаПоУмолчанию) Тогда
		ПрименитьНастройки(НастройкаПоУмолчанию);
	Иначе
		Объект.Период.Вариант = ВариантСтандартногоПериода.ЭтотГод;
		Сортировка            = "Кодификатор";
		ВыводитьСумму         = Истина;
		ВыводитьКодификатор   = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Сценарий) Тогда
		Объект.Сценарий = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойСценарий",
							Пользователи.ТекущийПользователь());
		СценарийПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

// Функция получает настройку пользователя по-умолчанию.
//
// Параметры:
//  Ответственный - СправочникСсылка.Пользователи (необязательный). Пользователь,
//		для которого собирается информация о доступных визах. Если значение не заполнено,
//		определяется доступность для текущего пользователя.
// Возвращаемое значение:
//  ВыбраннаяНастройка  - СправочникСсылка.бит_СохраненныеНастройки.
//
&НаСервере
Функция НастройкаПоУмолчанию(Ответственный = Неопределено)
	
	Если Ответственный = Неопределено Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
		
	// Получим настройку по - умолчанию.
	НастройкаПоУмолчанию = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(НастраиваемыйОбъект(),,, Ответственный);
	
	Если ЗначениеЗаполнено(НастройкаПоУмолчанию) Тогда
		Возврат НастройкаПоУмолчанию;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура РазбиватьДокументыПоАналитикамПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы(ЭтотОбъект);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтатьяОборотовСтатиБюджета(СтатьяБюджета)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяБюджета, "СтатьяОборотов");
	
КонецФункции

&НаСервере
Процедура УстановитьОтборСтатейБюджета()
	
	Объект.Компоновщик.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Бюджет", Объект.ОтборБюджет);
	
КонецПроцедуры

#КонецОбласти

#Область ЗамерыПроизводительностиAPDEX

&НаКлиенте
Процедура ЗапуститьЗамерДлительностиКлючевойОперации(НаименованиеОперации)
	
	КлючеваяОперация = НаименованиеОперации + ".бит_СводныйБюджет";
	
	ИдентификаторЗамераВремени = ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьДлительностьКлючевойОперации()
	
	ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(ИдентификаторЗамераВремени);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
